Revit 2027 API
BuiltInFailures.FamilyFailures.InvalidInsertOrientation Property
 The insert orientation is incompatible with the wall's cross-section.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidInsertOrientation { get; }
Public Shared ReadOnly Property InvalidInsertOrientation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidInsertOrientation {
	FailureDefinitionId^ get ();
}
static member InvalidInsertOrientation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace